In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn as sns

In [2]:
data = pd.read_csv("../Data/clean/london_crime_and_house_price_data_2012-16.csv")

In [3]:
data.head()

,lsoa_code,borough,major_category,minor_category,value,year,month,month_name,average_house_price
0,E01001116,Croydon,Burglary,Burglary in Other Buildings,0,2016,11,November,363662.25
1,E01001646,Greenwich,Violence Against the Person,Other violence,0,2016,11,November,371158.48
2,E01000677,Bromley,Violence Against the Person,Other violence,0,2015,5,May,377117.73
3,E01003774,Redbridge,Burglary,Burglary in Other Buildings,0,2016,3,March,388150.79
4,E01001320,Ealing,Theft and Handling,Other Theft,0,2012,5,May,310930.90

In [ ]:
#Which regions have the highest/ lowest number of crimes?

In [4]:
crime_count= data.groupby(['borough']).agg({'major_category':'count'})
crime_count

                        major_category
borough
Barking and Dagenham            172800
Barnet                          318240
Bexley                          214260
Brent                           272580
Bromley                         291060
Camden                          210240
City of London                    5400
Croydon                         334500
Ealing                          305220
Enfield                         283980
Greenwich                       234000
Hackney                         232080
Hammersmith and Fulham          182640
Haringey                        229920
Harrow                          203160
Havering                        222000
Hillingdon                      245880
Hounslow                        219960
Islington                       199560
Kensington and Chelsea          164880
Kingston upon Thames            144180
Lambeth                         288360
Lewisham                        269520
Merton                          188820
Newham                          261900
Redbridge                       247620
Richmond upon Thames            168960
Southwark                       268500
Sutton                          179160
Tower Hamlets                   228960
Waltham Forest                  225720
Wandsworth                      277020
Westminster                     203700

In [7]:
crime_count[crime_count.major_category == crime_count.major_category.max()]

         major_category
borough
Croydon          334500

In [8]:
crime_count[crime_count.major_category == crime_count.major_category.min()]

                major_category
borough
City of London            5400